const dataTest = [
  {
    id: 1,
    name: "T-shirt DOP-1617 One Piece OP ขาว",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/39403/0?9553",
  },
  {
    id: 2,
    name: "T-shirt DOP-1617 One Piece OP ดำ",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/39403/2",
  },
  {
    id: 3,
    name: "T-shirt DOP-1675 One Piece ลาย Shank แดง",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38957/0?8209",
  },
  {
    id: 4,
    name: "T-shirt DOP-1675 One Piece ลาย Shank ดำ",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38957/2",
  },
  {
    id: 5,
    name: "T-shirt DOP-1675 One Piece ลาย Shank ขาว",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38957/4",
  },
  {
    id: 6,
    name: "T-shirt DOP-1676 One Piece ลาย Luffy แดง",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38956/0?4291",
  },
  {
    id: 7,
    name: "T-shirt DOP-1675 One Piece ลาย Luffy ดำ",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38956/2",
  },
  {
    id: 8,
    name: "T-shirt DOP-1675 One Piece ลาย Luffy ขาว",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38956/4",
  },
  {
    id: 9,
    name: "T-shirt DOP-160ุ2 One Piece Film Red Luffy ดำ",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38555/0?7159",
  },
  {
    id: 10,
    name: "T-shirt DOP-160ุ2 One Piece Film Red Luffy แดง",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38555/2",
  },
  {
    id: 11,
    name: "T-shirt DOP-1601 One Piece Film Red Luffy ดำ",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38553/0?6533",
  },
  {
    id: 12,
    name: "T-shirt DOP-1601 One Piece Film Red Luffy กรม",
    price: 390000,
    description:
      "Barcode: unisex ใส่ได้ทุกเพศทุกวัย สินค้าลิขสิทธิ์แท้จากประเทศญี่ปุ่น ผลิตจากผ้าคอตตอน 100% สัมผัสนุ่ม ใส่สบาย มีความยืดหยุ่นสูง เนื้อผ้านุ่ม ไม่ร้อน สามารถระบายอากาศ หรือความร้อนได้ดี ดูดซับเหงื่อ เหมาะสำหรับผู้ที่ทำกิจกรรมกลางแจ้ง ลายสกรีนโดนเด่น เม็ดสกรีนสวยงาม คุณภาพดี ไม่หลุด ไม่ลอก ไม่เหนียวเหนอะหนะติดตัว วิธีดูแลเสื้อผ้า ให้สวยเหมือนใหม่ใส่ได้นาน หลีกเลี่ยงการใช้ความร้อนกับผ้า กลับเสื้อด้านในออกมาก่อนซัก แยกสีผ้าก่อนซัก ใช้ผลิตภัณฑ์ซักผ้า ให้เหมาะกับประเภทของเสื้อผ้า ควรตากในที่แดดไม่จัด และมีอากาศถ่ายเทสะดวก การทำความสะอาดเฉพาะจุด หากเสื้อผ้าของเรามีคราบเฉพาะจุดเป็นบริเวณเล็ก ๆ ก็ควรทำความสะอาดเป็นพิเศษ ให้คราบสลายออกไปบางส่วน เพื่อง่ายเวลานำไปซักต่อ ซึ่งอาจจะใช้น้ำยาป้ายทิ้งไว้ หรือ ใช้วิธีการแช่ผ้าก่อนที่จะนำไปซัก แต่สิ่งที่ต้องระวังก็คือการใช้แปรงขัดและการขยี้แรง ๆ ที่เดิมซ้ำ ๆ เพราะอาจจะทำให้ผ้าบริเวณนั้นสีซีดลงจนไม่ผ้ามีสีไม่สม่ำเสมอกันค่ะ ป้องกันผ้าสีตกและคงความสดของสีด้วยเกลือ โดยการเติมเกลือลงไปในถังซักผ้าโดยตรงประมาณครึ่งถ้วยตวง หรือ 8 ช้อนโต๊ะ หรือ ถ้าเป็นการซักมือก็ใช้วิธีการแช่ผ้าในน้ำเกลือก่อนประมาณ 1 – 2 ชั่วโมง แล้วค่อยนำไปล้าง หรือ ซักตามปกติค่ะ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/38553/2",
  },
  {
    id: 13,
    name: "T-shirt DOP-1594 One Piece",
    price: 390000,
    description:
      "Barcode: unisex ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "https://shop.dexclub.com/imgs/37852/0?9160",
  },
  {
    id: 14,
    name: "Trousers",
    price: 390000,
    description:
      "Barcode: unisex ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "../images/Screenshot 2024-04-12 181027.jpg" ,
  },
  {
    id: 14,
    name: "Trousers",
    price: 390000,
    description:
      "Barcode: unisex ",
    type: "T-shirt",
    brand: "One Piece",
    quantity: 10,
    sday: "01.04.67",
    lday: "30.04.67",
    img: "../images/Screenshot2024-04-12181026.jpg",
  },
];

function getAllProducts() {
  return dataTest;
}

// Get a single product by id
function getProductById(id) {
  return dataTest.find((product) => product.id === id);
}

// Add a new product
function addProduct(newProduct) {
  const maxId = Math.max(...dataTest.map((product) => product.id));
  const id = maxId + 1;
  const product = { id, ...newProduct };
  dataTest.push(product);
  return product;
}

// Update an existing product
function updateProduct(id, updatedProduct) {
  const index = dataTest.findIndex((product) => product.id === id);
  if (index === -1) {
    throw new Error(`Product with id ${id} not found`);
  }
  dataTest[index] = { ...dataTest[index], ...updatedProduct };
  return dataTest[index];
}

// Delete a product
function deleteProduct(id) {
  const index = dataTest.findIndex((product) => product.id === id);
  if (index === -1) {
    throw new Error(`Product with id ${id} not found`);
  }
  const deletedProduct = dataTest.splice(index, 1)[0];
  return deletedProduct;
}

export {
  getAllProducts,
  getProductById,
  addProduct,
  updateProduct,
  deleteProduct,
};
